{"pageProps":{"post":{"title":"Miscellaneous","date":"2021-04-10T23:27:16.058Z","slug":"misc","author":"AutoGenerated","content":"<h3>Miscellaneous tips collected from the game</h3>\n<p>Duplicate Crew: A duplicate Crew Member is converted into Crew Tokens. If the Crew Member is at max Rank, then it is converted into Latinum.</p>\n<p>CREW COLLECTION: Crew can be found at the Nexus Portal or in the Store.</p>\n<p>LEVEL: Increasing a Crew Member's level is the most direct way to improve their stats.</p>\n<p>POWER: Power is a general indicator of how strong a Crew Member is. It takes into account a Crew Member's level, rank, skills, Nexus Particles, and anything else that improves a Crew Member's combat capabilities.</p>\n<p>RANK: Increase a Crew Member's Rank to increase their Power!</p>\n<p>RARITY: A Crew Member's rarity determines their maximum Power and are earned at higher difficulties.</p>\n<p>ROLE: The Crew Member's role represents their area of expertise. During missions, they will contribute to any Proficiency checks that correspond to their role.</p>\n<p>TAGS: these are the Crew Member's tags</p>\n<p>Attack: One of two Stats that can be used to deal damage. Every Skill's description will specify which Stat it uses.</p>\n<p>Crit Chance: A percentage that indicates how likely the Crew Member's attack will Crit.</p>\n<p>Crit Damage: A percentage that indicates the increased damage the Crew Member's attack will do when it Crits.</p>\n<p>Defense: Decreases damage taken from enemy attacks.</p>\n<p>Glancing Chance: A percentage that indicates how likely the enemy's attack will Glance.</p>\n<p>Glancing Damage: A percentage that indicates the reduced damage the Crew Member will take when an enemy's attack Glances.</p>\n<p>Health: Determines the Crew Member's max health.</p>\n<p>Resolve: A percentage that indicates how likely a Crew Member is to resist losing Morale.</p>\n<p>Speed: Determines the turn order in battle. Crew with higher speed take their turn first.</p>\n<p>Tech: One of two Stats that can be used to deal damage. Every Skill's description will specify which Stat it uses.</p>\n<p>PLAYER LEVEL: Collect XP from Missions, Operations, PVP and other game modes to increase your Player level.</p>\n<p>PVP LEAGUE: The PvP League you belong to changes with your Medal count! Increase your League to get better items in the Daily Replicator and better rewards from PvP battles.</p>\n<p>COMMAND PROFICIENCY: This is your Away Team's total Command Proficiency. Crew with the COMMAND Role contribute to this score.</p>\n<p>ENGINEERING PROFICIENCY: This is your Away Team's total Engineering Proficiency. Crew with the ENGINEERING Role contribute to this score.</p>\n<p>MEDICAL PROFICIENCY: This is your Away Team's total Medical Proficiency. Crew with the MEDICAL Role contribute to this score.</p>\n<p>SCIENCE PROFICIENCY: This is your Away Team's total Science Proficiency. Crew with the SCIENCE Role contribute to this score.</p>\n<p>SECURITY PROFICIENCY: This is your Away Team's total Security Proficiency. Crew with the SECURITY Role contribute to this score.</p>\n<p>This number is the combined Power of all away team members! The more Power your away team has, the more likely they are to accomplish their mission.</p>\n<h3>NEXUS PARTICLES</h3>\n<p>LEVEL: A Nexus Particle's level reflects how many times it has been upgraded.</p>\n<p>RARITY: A Nexus Particle's <span style=\"color:#01e2ff\">Rarity</span> determines how strong its Nexus Power is, and how many Stats it can boost!</p>\n<p>TAGS: A Nexus Particle may have up to 3 tags. If a Crew Member does not possess at least one of the listed tags, they cannot equip the Particle.</p>\n<h3>Loading screen tips</h3>\n<p>Darmok and Jalad, at Tanagra.</p>\n<p>You can increase the level and rank of your Gear by finding the right Materials!</p>\n<p>Particles have random stats, so choose wisely!</p>\n<p>Some Crew have their own unique Gear!</p>\n<p>92nd Rule of Acquisition - There are many paths to Profit</p>\n<p>If a target has 3 stacks of Assimilation, they lose 50% of their max HP.</p>\n<p>Scan removes Cloak from the target and guarantees that the next hit against them will be a Critical Hit.</p>\n<p>Shield effects create a second, temporary health bar.</p>\n<p>Cleanse removes a number of negative status effects from an ally based on the Cleansing Crew Member's Tech stat.</p>\n<p>Shields block a limited amount of incoming damage and disappear when used up.</p>\n<p>Play new events to unlock new and exciting Crew and content!</p>\n<p>Purge removes a number of positive status effects from an enemy based on the Purging Crew Member's Tech stat.</p>\n<p>All attacks against Cloaked targets will Glance for the duration of the Cloak.</p>\n<p>Red Alert! The target’s Morale cannot be lowered while Red Alert is active.</p>\n<p>When a Bomb is planted on a target, the next time that target is attacked the Bomb will detonate and trigger its effect.</p>\n<p>Select and hold on a character in combat to see their skills, stats, and status effects.</p>\n<p>Access the Player Profile menu from the Bridge to view gameplay Stats, Options, and Notifications.</p>\n"},"allPosts":[{"title":"Stat Modifiers","slug":"statmod"},{"title":"Shuttlecrafts","slug":"shuttles"},{"title":"PvP Leagues","slug":"pvpLeagues"},{"title":"Particles","slug":"particles"},{"title":"Miscellaneous","slug":"misc"},{"title":"How to edit pages","slug":"howtoedit"},{"title":"Gears","slug":"gears"},{"title":"About the project","slug":"about"}]},"__N_SSG":true}